tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

cask_args appdir: "/Applications", require_sha: true

brew "mas"                                          # https://github.com/mas-cli/mas (Mac App Store CLI)
brew "tig"                                          # https://jonas.github.io/tig/ (Terminal UI for Git)
brew "node"                                         # Node.js
brew "ssh-copy-id"                                  # Pass your RSA keys on remote server
brew "gh"                                           # GitHub CLI
brew "docker-compose"
brew "mkcert"
brew "nvm"
brew "git"
brew "lazygit"
brew "fzf"

cask "warp"
cask "raycast"                                       # Spotlight / Alfred replacement https://www.raycast.com
cask "little-snitch"                                 # https://www.obdev.at/products/littlesnitch/index.html
cask "google-chrome"
cask "firefox"
cask "iterm2"                                        # https://www.iterm2.com
cask "visual-studio-code"                            # https://code.visualstudio.com
cask "spotify"
cask "discord"
cask "figma"
cask "docker"                                        
cask "notion"                                        # https://notion.so
cask "zoom"                                          # https://zoom.us
cask "arc"
cask "microsoft-edge"                                         

cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"


mas "Telegram",    id: 747648890
mas "Slack",       id: 803453959
mas "Hidden Bar",  id: 1452453066
mas "Velja",       id: 1607635845